Tekla.Structures.AnalysisInternal.DotAnalysisCurvature
The serialization structure for AnalysisCurvature.

Tekla.Structures.AnalysisInternal.DotAnalysisCurvature._Radius
The radius of the beam curvature.

Tekla.Structures.AnalysisInternal.DotAnalysisCurvature._RadiusDirection
The radius direction of the beam curvature.

Tekla.Structures.AnalysisInternal.DotAnalysisCurvature.ToStruct(Tekla.Structures.Analysis.AnalysisCurvature)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisCurvature.FromStruct(Tekla.Structures.Analysis.AnalysisCurvature)
DO NOT USE! For internal usage only!
P: P.